fn main() {
    // println!("안녕하세요.\n러스트에 오신 것을\n환영합니다.");
//     println!("안녕하세요.
// 러스트에 오신 것을
// 환영합니다.");
    println!("안녕하세요.\n\
    러스트에 오신 것을\n\
    환영합니다.");
}

// fn main() {
//     println!("합 : {}", 80.3 + 34.8);
//     println!("합 : {}", 80.3 + 34.9);
//     println!("합 : {}", 0.5);
//     println!("합 : {}", 0.25);
//     println!("합 : {}", 0.125);
//     println!("합 : {}", 34.9);
//     println!("합 : {}", 115.2);

//     // println!("{}", 5.1+2);
// }

// fn main() {
//     println!("{} + {} = {}", 80, 35, 80 + 35);
//     println!("{}", 13 / 6);
//     println!("{}", 13 % 6);
//     println!("{}", 23 - 6 % 5);
// }
